---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SymbolGeometryId Properties
SymbolGeometryId Class See Also Send Feedback
---

The SymbolGeometryId type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SymbolId | The id of the symbol that is containing the shared geometry. |

# See Also

SymbolGeometryId Class

Autodesk.Revit.DB Namespace